
//获取图片地址
export function getImgSrc(richtext,num){
	let imgList = [];
	richtext.replace(/img[^>]*src=['"]([^'"]+)[^>]/g,(match,capture)=>{
		imgList.push(capture);
	});
	imgList = imgList.slice(0,num);
	return imgList;
}
//向外导出省市
export function getProvince(){
	return new Promise((resolve,reject)=>{
		let historyProvince = uni.getStorageSync("historyProvince");
		console.log(historyProvince);
		if(historyProvince){
			if((Date.now() - historyProvince.time) > 1000*60*60){
				getIp().then((res)=>{
					resolve(res);
				}).catch((err)=>{
					reject(err)
				})
			}else{
				resolve(historyProvince.province);
			}
			
		}else{
			getIp().then((res)=>{
				resolve(res);
			}).catch((err)=>{
				reject(err)
			})
		}
		
	})
	
}
//获取所在省市
function getIp(){
	return new Promise((resolve,reject)=>{
		uni.request({
			url:"https://restapi.amap.com/v3/ip?key=f3346ff1eb17564d2924e5312768b3ff",
			success: (res) => {
				
				let str="";
				typeof(res.data.province=="string")?str = res.data.province:str="获取地址异常！";
				resolve(str);
				let obj = {
					province:str,
					time:Date.now()
				}
				uni.setStorageSync("historyProvince",obj);
			},
			fail: (err) => {
				reject(err);
			}
		})
	})
}
//获取用户昵称
export function getName(item){
	return item.user_id[0].nickname || item.user_id[0].username || item.user_id[0].mobile || "请设置昵称"
}
export function getAvatar(item){
	//可选链
	return item.user_id[0]?.avatar_file?.url ?? '../../static/user-default.jpg'
}

const db = uniCloud.database();
const utilsObj = uniCloud.importObject("utilsObj", {
		customUI: true
	});
//点赞操作
export async function likeFun(detailId){
	let count = await db.collection("quanzi_like").where(
		`article_id=="${detailId}" && user_id==$cloudEnv_uid`).count();
	console.log(count);
	if (!count.result.total) {
		db.collection("quanzi_like").add({
			article_id: detailId
		})
		utilsObj.operation("quanzi_article", "like_count", detailId, 1)
		// this.likeActive =true;
	} else {
	
		db.collection("quanzi_like").where(`article_id=="${detailId}" && user_id==$cloudEnv_uid`)
			.remove()
		utilsObj.operation("quanzi_article", "like_count", detailId, -1)
	}
}
export function getJsonstr(){
let a =[]
return a;
}

export function getZhuanke(){
	// 原始数据（假设存储为二维数组）
	const allArrays = [
	["保险实务", "财富管理", "财税大数据应用", "大数据与财务管理", "大数据与会计", "大数据与审计", "关务与外贸服务", "国际金融", "国际经济与贸易", "国际商务", "金融服务与管理",
		"金融科技应用", "跨境电子商务", "农村电子商务", "商务数据分析与应用", "市场调查与统计分析", "统计与大数据分析", "证券实务", "资产评估与管理"
	],
	["材料工程技术", "储能材料技术", "电厂化学与环保技术", "非金属矿物材料技术", "分析检验技术", "复合材料智能制造技术", "高分子材料智能制造技术", "化工生物技术", "化工装备技术", "化学制药技术",
		"化妆品技术", "环境工程技术", "精细化工技术", "理化测试与质检技术", "煤化工技术", "煤炭清洁利用技术", "氢能技术应用", "生态环境修复技术", "石油化工技术", "数字化染整技术",
		"陶瓷制造技术与工艺", "小学科学教育", "新能源材料应用技术", "药品生产技术", "应用化工技术", "有色金属智能冶金技术"
	],
	["临床医学"],
	["茶叶生产与加工技术", "茶艺与茶文化", "风景园林设计", "花卉生产与花艺", "环境艺术设计", "林业技术", "林业信息技术应用", "绿色生物制造技术", "绿色食品生产技术", "农产品加工与质量检测",
		"农业生物技术", "森林和草原资源保护", "森林生态旅游与康养", "设施农业与装备", "生态农业技术", "食品生物技术", "水土保持技术", "现代农业技术", "休闲农业经营与管理", "烟草栽培与加工技术",
		"药品生物技术", "野生动植物资源保护与利用", "园林工程技术", "园林技术", "园艺技术", "植物保护与检疫技术", "中草药栽培与加工技术", "中药材生产与加工", "种子生产与经营",
		"自然保护地建设与管理", "作物生产与经营管理"
	],
	["保险实务", "财富管理", "财税大数据应用", "大数据与财务管理", "大数据与会计", "大数据与审计", "关务与外贸服务", "国际金融", "国际经济与贸易", "国际商务", "金融服务与管理",
		"金融科技应用", "跨境电子商务", "农村电子商务", "商务数据分析与应用", "市场调查与统计分析", "统计与大数据分析", "证券实务", "资产评估与管理"
	],
	["公共卫生管理", "化工生物技术", "粮食储运与质量安全", "粮食工程技术与管理", "农产品加工与质量检测", "烹饪工艺与营养", "食品检验检测技术", "食品生物技术", "食品药品监督管理", "食品营养与健康",
		"食品质量与安全", "食品智能加工技术", "食品贮运与营销", "食用菌生产与加工技术", "西式烹饪工艺", "医学营养", "营养配餐", "中西面点工艺"
	],
	["口腔医学"],
	["旅游英语", "商务英语", "小学英语教育", "应用英语"],
	["保险实务", "财富管理", "财税大数据应用", "大数据与财务管理", "大数据与会计", "大数据与审计", "关务与外贸服务", "国际金融", "国际经济与贸易", "国际商务", "金融服务与管理",
		"金融科技应用", "跨境电子商务", "农村电子商务", "商务数据分析与应用", "市场调查与统计分析", "统计与大数据分析", "证券实务", "资产评估与管理"
	],
	["公共卫生管理", "化工生物技术", "化学制药技术", "粮食储运与质量安全", "粮食工程技术与管理", "农产品加工与质量检测", "烹饪工艺与营养", "生物制药技术", "食品检验检测技术", "食品生物技术",
		"食品药品监督管理", "食品营养与健康", "食品质量与安全", "食品智能加工技术", "食品贮运与营销", "食用菌生产与加工技术", "西式烹饪工艺", "药品经营与管理", "药品生产技术", "药品生物技术",
		"药品质量与安全", "药物制剂技术", "药学", "医学营养", "营养配餐", "中西面点工艺", "中药材生产与加工", "中药学", "中药制药"
	],
	["卫生检验与检疫技术", "医学检验技术"],
	["健康大数据管理与服务", "健康管理", "康复工程技术", "老年保健与管理", "美容美体艺术", "社区康复", "医学营养", "婴幼儿托育服务与管理", "预防医学", "智慧健康养老服务与管理",
	"中医养生保健"],
	["保险实务", "财富管理", "财税大数据应用", "大数据与财务管理", "大数据与会计", "大数据与审计", "关务与外贸服务", "国际金融", "国际经济与贸易", "国际商务", "金融服务与管理",
		"金融科技应用", "跨境电子商务", "农村电子商务", "商务数据分析与应用", "市场调查与统计分析", "统计与大数据分析", "证券实务", "资产评估与管理"
	],
	["城乡规划", "风景园林设计", "古建筑工程技术", "环境艺术设计", "建筑动画技术", "建筑设计", "建筑室内设计", "建筑装饰工程技术", "园林技术", "装配式建筑工程技术"],
	["医学影像技术"],
	["表演艺术", "钢琴调律", "歌舞表演", "国际标准舞", "乐器制造与维护", "曲艺表演", "时尚表演与传播", "舞蹈编导", "舞蹈表演", "舞蹈教育", "戏剧影视表演", "戏曲表演", "戏曲音乐",
		"现代流行音乐", "现代魔术设计与表演", "音乐表演", "音乐教育", "音乐剧表演"
	],
	["保险实务", "财富管理", "财税大数据应用", "大数据与财务管理", "大数据与会计", "大数据与审计", "关务与外贸服务", "国际金融", "国际经济与贸易", "国际商务", "金融服务与管理",
		"金融科技应用", "跨境电子商务", "农村电子商务", "商务数据分析与应用", "市场调查与统计分析", "统计与大数据分析", "证券实务", "资产评估与管理"
	],
	["化学制药技术", "生物制药技术", "药品经营与管理", "药品生产技术", "药品生物技术", "药品质量与安全", "药物制剂技术", "药学", "中药材生产与加工", "中药学", "中药制药"],
	["眼视光技术"],
	["保险实务", "财富管理", "财税大数据应用", "大数据与财务管理", "大数据与会计", "大数据与审计", "关务与外贸服务", "国际金融", "国际经济与贸易", "国际商务", "金融服务与管理",
		"金融科技应用", "跨境电子商务", "农村电子商务", "商务数据分析与应用", "市场调查与统计分析", "统计与大数据分析", "证券实务", "资产评估与管理"
	],
	["安全防范技术", "道路交通管理", "法律事务", "法律文秘", "检察事务", "经济犯罪侦查", "警务指挥与战术", "民航空中安全保卫", "社区矫正", "司法鉴定技术", "司法警务", "司法信息技术",
		"网络安全与执法", "刑事科学技术", "刑事侦查", "刑事侦查技术", "刑事执行", "行政执行", "政治安全保卫", "知识产权管理", "治安管理", "罪犯心理测量与矫正技术"
	],
	["化学制药技术", "生物制药技术", "药品经营与管理", "药品生产技术", "药品生物技术", "药品质量与安全", "药物制剂技术", "药学", "中药材生产与加工", "中药学", "中药制药"],
	["呼吸治疗技术", "康复辅助器具技术", "康复治疗技术", "老年保健与管理", "言语听觉康复技术", "中医康复技术"],
	["呼吸治疗技术", "康复辅助器具技术", "康复治疗技术", "老年保健与管理", "言语听觉康复技术", "中医康复技术"],
	["保险实务", "财富管理", "财税大数据应用", "大数据与财务管理", "大数据与会计", "大数据与审计", "关务与外贸服务", "国际金融", "国际经济与贸易", "国际商务", "金融服务与管理",
		"金融科技应用", "跨境电子商务", "农村电子商务", "商务数据分析与应用", "市场调查与统计分析", "统计与大数据分析", "证券实务", "资产评估与管理"
	],
	["社会工作", "社区管理与服务", "社区矫正", "小学道德与法治教育", "小学教育", "心理咨询", "智慧健康养老服务与管理"],
	["化学制药技术", "生物制药技术", "药品经营与管理", "药品生产技术", "药品生物技术", "药品质量与安全", "药物制剂技术", "药学", "中药材生产与加工", "中药学", "中药制药"],
	["口腔卫生保健", "口腔医学技术"],
	["安全防范技术", "道路交通管理", "法律事务", "法律文秘", "检察事务", "经济犯罪侦查", "警务指挥与战术", "民航空中安全保卫", "社区矫正", "司法鉴定技术", "司法警务", "司法信息技术",
		"网络安全与执法", "刑事科学技术", "刑事侦查", "刑事侦查技术", "刑事执行", "行政执行", "政治安全保卫", "知识产权管理", "治安管理", "罪犯心理测量与矫正技术"
	],
	["美术教育", "特殊教育", "舞蹈教育", "现代教育技术", "小学道德与法治教育", "小学教育", "小学科学教育", "小学数学教育", "小学英语教育", "小学语文教育", "心理咨询", "学前教育",
		"艺术教育", "音乐教育", "婴幼儿托育服务与管理", "早期教育", "罪犯心理测量与矫正技术"
	],
	["茶叶生产与加工技术", "茶艺与茶文化", "风景园林设计", "花卉生产与花艺", "环境艺术设计", "林业技术", "林业信息技术应用", "绿色生物制造技术", "绿色食品生产技术", "农产品加工与质量检测",
		"农业生物技术", "森林和草原资源保护", "森林生态旅游与康养", "设施农业与装备", "生态农业技术", "食品生物技术", "水土保持技术", "现代农业技术", "休闲农业经营与管理", "烟草栽培与加工技术",
		"药品生物技术", "野生动植物资源保护与利用", "园林工程技术", "园林技术", "园艺技术", "植物保护与检疫技术", "中草药栽培与加工技术", "中药材生产与加工", "种子生产与经营",
		"自然保护地建设与管理", "作物生产与经营管理"
	],
	["护理", "助产"],
	["护理", "助产"],
	["社会工作", "社区管理与服务", "社区矫正", "小学道德与法治教育", "小学教育", "心理咨询", "智慧健康养老服务与管理"],
	["美术教育", "特殊教育", "舞蹈教育", "现代教育技术", "小学道德与法治教育", "小学教育", "小学科学教育", "小学数学教育", "小学英语教育", "小学语文教育", "心理咨询", "学前教育",
		"艺术教育", "音乐教育", "婴幼儿托育服务与管理", "早期教育", "罪犯心理测量与矫正技术"
	],
	["茶叶生产与加工技术", "茶艺与茶文化", "风景园林设计", "花卉生产与花艺", "环境艺术设计", "林业技术", "林业信息技术应用", "绿色生物制造技术", "绿色食品生产技术", "农产品加工与质量检测",
		"农业生物技术", "森林和草原资源保护", "森林生态旅游与康养", "设施农业与装备", "生态农业技术", "食品生物技术", "水土保持技术", "现代农业技术", "休闲农业经营与管理", "烟草栽培与加工技术",
		"药品生物技术", "野生动植物资源保护与利用", "园林工程技术", "园林技术", "园艺技术", "植物保护与检疫技术", "中草药栽培与加工技术", "中药材生产与加工", "种子生产与经营",
		"自然保护地建设与管理", "作物生产与经营管理"
	],
	["中医骨伤", "中医学"],
	["电子竞技运动与管理", "高尔夫球运动与管理", "健身指导与管理", "民族传统体育", "社会体育", "社区康复", "体育保健与康复", "体育教育", "体育艺术表演", "体育运营与管理", "休闲体育",
		"运动防护", "运动健康指导", "运动训练"
	],
	["美术教育", "特殊教育", "舞蹈教育", "现代教育技术", "小学道德与法治教育", "小学教育", "小学科学教育", "小学数学教育", "小学英语教育", "小学语文教育", "心理咨询", "学前教育",
		"艺术教育", "音乐教育", "婴幼儿托育服务与管理", "早期教育", "罪犯心理测量与矫正技术"
	],
	["茶叶生产与加工技术", "茶艺与茶文化", "风景园林设计", "花卉生产与花艺", "环境艺术设计", "林业技术", "林业信息技术应用", "绿色生物制造技术", "绿色食品生产技术", "农产品加工与质量检测",
		"农业生物技术", "森林和草原资源保护", "森林生态旅游与康养", "设施农业与装备", "生态农业技术", "食品生物技术", "水土保持技术", "现代农业技术", "休闲农业经营与管理", "烟草栽培与加工技术",
		"药品生物技术", "野生动植物资源保护与利用", "园林工程技术", "园林技术", "园艺技术", "植物保护与检疫技术", "中草药栽培与加工技术", "中药材生产与加工", "种子生产与经营",
		"自然保护地建设与管理", "作物生产与经营管理"
	],
	["针灸推拿"],
	["传播与策划", "法律文秘", "特殊教育", "网络新闻与传播", "现代文秘", "小学教育", "小学语文教育", "新闻采编与制作", "中文"],
	["小学教育", "小学数学教育"],
	["茶叶生产与加工技术", "茶艺与茶文化", "风景园林设计", "花卉生产与花艺", "环境艺术设计", "林业技术", "林业信息技术应用", "绿色生物制造技术", "绿色食品生产技术", "农产品加工与质量检测",
		"农业生物技术", "森林和草原资源保护", "森林生态旅游与康养", "设施农业与装备", "生态农业技术", "食品生物技术", "水土保持技术", "现代农业技术", "休闲农业经营与管理", "烟草栽培与加工技术",
		"药品生物技术", "野生动植物资源保护与利用", "园林工程技术", "园林技术", "园艺技术", "植物保护与检疫技术", "中草药栽培与加工技术", "中药材生产与加工", "种子生产与经营",
		"自然保护地建设与管理", "作物生产与经营管理"
	],
	["健身指导与管理", "民族传统体育", "社会体育", "体能训练", "体育保健与康复", "体育教育", "休闲体育", "运动健康指导", "运动数据分析", "运动训练"],
	["宝玉石鉴定与加工", "测绘地理信息技术", "测绘工程技术", "导航与位置服务", "地籍测绘与土地管理", "地球物理勘探技术", "地下与隧道工程技术", "地质调查与矿产普查", "工程测量技术", "工程地质勘查",
		"国土空间规划与测绘", "国土资源调查与管理", "空间数字建模与应用技术", "矿井建设工程技术", "矿山机电与智能装备", "煤矿智能开采技术", "煤炭清洁利用技术", "摄影测量与遥感技术", "石油工程技术",
		"水利水电建筑工程", "水文与工程地质", "通风技术与安全管理", "无人机测绘技术", "无人机应用技术", "岩土工程技术", "油气储运技术", "油气智能开采技术", "智慧水利技术"
	],
	["小学教育", "心理健康教育", "心理咨询", "罪犯心理测量与矫正技术"],
	["茶叶生产与加工技术", "茶艺与茶文化", "风景园林设计", "花卉生产与花艺", "环境艺术设计", "林业技术", "林业信息技术应用", "绿色生物制造技术", "绿色食品生产技术", "农产品加工与质量检测",
		"农业生物技术", "森林和草原资源保护", "森林生态旅游与康养", "设施农业与装备", "生态农业技术", "食品生物技术", "水土保持技术", "现代农业技术", "休闲农业经营与管理", "烟草栽培与加工技术",
		"药品生物技术", "野生动植物资源保护与利用", "园林工程技术", "园林技术", "园艺技术", "植物保护与检疫技术", "中草药栽培与加工技术", "中药材生产与加工", "种子生产与经营",
		"自然保护地建设与管理", "作物生产与经营管理"
	],
	["电子竞技运动与管理", "高尔夫球运动与管理", "健身指导与管理", "民族传统体育", "社会体育", "社区康复", "体育保健与康复", "体育教育", "体育艺术表演", "体育运营与管理", "休闲体育",
		"运动防护", "运动健康指导", "运动训练"
	],
	["小学教育", "心理健康教育", "心理咨询", "罪犯心理测量与矫正技术"],
	["宝玉石鉴定与加工", "测绘地理信息技术", "测绘工程技术", "导航与位置服务", "地籍测绘与土地管理", "地球物理勘探技术", "地下与隧道工程技术", "地质调查与矿产普查", "工程测量技术", "工程地质勘查",
		"国土空间规划与测绘", "国土资源调查与管理", "空间数字建模与应用技术", "矿井建设工程技术", "矿山机电与智能装备", "煤矿智能开采技术", "煤炭清洁利用技术", "摄影测量与遥感技术", "石油工程技术",
		"水利水电建筑工程", "水文与工程地质", "通风技术与安全管理", "无人机测绘技术", "无人机应用技术", "岩土工程技术", "油气储运技术", "油气智能开采技术", "智慧水利技术"
	],
	["茶叶生产与加工技术", "茶艺与茶文化", "风景园林设计", "花卉生产与花艺", "环境艺术设计", "林业技术", "林业信息技术应用", "绿色生物制造技术", "绿色食品生产技术", "农产品加工与质量检测",
		"农业生物技术", "森林和草原资源保护", "森林生态旅游与康养", "设施农业与装备", "生态农业技术", "食品生物技术", "水土保持技术", "现代农业技术", "休闲农业经营与管理", "烟草栽培与加工技术",
		"药品生物技术", "野生动植物资源保护与利用", "园林工程技术", "园林技术", "园艺技术", "植物保护与检疫技术", "中草药栽培与加工技术", "中药材生产与加工", "种子生产与经营",
		"自然保护地建设与管理", "作物生产与经营管理"
	],
	["表演艺术", "钢琴调律", "歌舞表演", "乐器制造与维护", "曲艺表演", "舞蹈编导", "戏剧影视表演", "戏曲表演", "戏曲音乐", "现代流行音乐", "音乐表演", "音乐教育", "音乐剧表演"],
	["城市轨道车辆应用技术", "城市轨道交通车辆制造与维护", "城市轨道交通机电技术", "电机与电器技术", "电力系统自动化技术", "电气自动化技术", "电梯工程技术", "电线电缆制造技术", "动车组检修技术",
		"纺织机电技术", "飞机部件修理", "飞机电子设备维修", "飞机机电设备维修", "飞机结构修理", "工业产品质量检测技术", "工业工程技术", "工业过程自动化技术", "工业互联网技术", "工业互联网应用",
		"工业机器人技术", "工业设计", "光伏工程技术", "机场电工技术", "机电设备技术", "机电一体化技术", "机械设计与制造", "机械制造及自动化", "机械装备制造技术", "矿山机电与智能装备",
		"轮机工程技术", "模具设计与制造", "设施农业与装备", "数控技术", "数字化设计与制造技术", "铁道车辆技术", "铁道机车运用与维护", "通风技术与安全管理", "通用航空航务技术", "通用航空器维修",
		"无人机应用技术", "现代农业装备应用技术", "印刷媒体技术", "印刷设备应用技术", "智能工程机械运用技术", "智能光电制造技术", "智能机电技术", "智能机器人技术", "智能控制技术",
		"智能制造装备技术"
	],
	["宝玉石鉴定与加工", "材料成型及控制技术", "材料工程技术", "储能材料技术", "电线电缆制造技术", "非金属矿物材料技术", "复合材料智能制造技术", "高分子材料智能制造技术", "光伏工程技术",
		"化妆品技术", "建筑材料检测技术", "建筑装饰材料技术", "模具设计与制造", "氢能技术应用", "陶瓷制造技术与工艺", "特种加工技术", "现代造纸技术", "新型建筑材料技术", "有色金属智能冶金技术",
		"智能焊接技术"
	],
	["宠物养护与驯导", "宠物医疗技术", "动物防疫与检疫", "动物药学", "动物医学", "动物营养与饲料", "兽药制药技术", "水产养殖技术", "特种动物养殖技术", "畜牧兽医", "畜禽智能化养殖"],
	["表演艺术", "钢琴调律", "歌舞表演", "乐器制造与维护", "曲艺表演", "舞蹈编导", "戏剧影视表演", "戏曲表演", "戏曲音乐", "现代流行音乐", "音乐表演", "音乐教育", "音乐剧表演"],
	["安全技术与管理", "测绘地理信息技术", "城市轨道交通工程技术", "城市燃气工程技术", "城乡规划", "道路工程检测技术", "道路工程造价", "道路养护与管理", "道路与桥梁工程技术", "地籍测绘与土地管理",
		"地下与隧道工程技术", "风景园林设计", "高速铁路施工与维护", "工程造价", "供热通风与空调工程技术", "古建筑工程技术", "建设工程管理", "建设工程监理", "建筑材料检测技术",
		"建筑电气工程技术", "建筑钢结构工程技术", "建筑工程技术", "建筑设备工程技术", "建筑设计", "建筑消防技术", "建筑智能化工程技术", "建筑装饰材料技术", "建筑装饰工程技术",
		"空间数字建模与应用技术", "市政工程技术", "水利水电建筑工程", "水文与工程地质", "太阳能光热技术与应用", "铁道工程技术", "土木工程检测技术", "无人机测绘技术", "新型建筑材料技术",
		"岩土工程技术", "园林工程技术", "智能建造技术", "装配式建筑工程技术"
	],
	["城市轨道车辆应用技术", "城市轨道交通车辆制造与维护", "城市轨道交通机电技术", "电机与电器技术", "电力系统自动化技术", "电气自动化技术", "电梯工程技术", "电线电缆制造技术", "动车组检修技术",
		"纺织机电技术", "飞机部件修理", "飞机电子设备维修", "飞机机电设备维修", "飞机结构修理", "工业产品质量检测技术", "工业工程技术", "工业过程自动化技术", "工业互联网技术", "工业互联网应用",
		"工业机器人技术", "工业设计", "光伏工程技术", "机场电工技术", "机电设备技术", "机电一体化技术", "机械设计与制造", "机械制造及自动化", "机械装备制造技术", "矿山机电与智能装备",
		"轮机工程技术", "模具设计与制造", "设施农业与装备", "数控技术", "数字化设计与制造技术", "铁道车辆技术", "铁道机车运用与维护", "通风技术与安全管理", "通用航空航务技术", "通用航空器维修",
		"无人机应用技术", "现代农业装备应用技术", "印刷媒体技术", "印刷设备应用技术", "智能工程机械运用技术", "智能光电制造技术", "智能机电技术", "智能机器人技术", "智能控制技术",
		"智能制造装备技术"
	],
	["城市轨道车辆应用技术", "城市轨道交通车辆制造与维护", "城市轨道交通机电技术", "电机与电器技术", "电力系统自动化技术", "电气自动化技术", "电梯工程技术", "电线电缆制造技术", "动车组检修技术",
		"纺织机电技术", "飞机部件修理", "飞机电子设备维修", "飞机机电设备维修", "飞机结构修理", "工业产品质量检测技术", "工业工程技术", "工业过程自动化技术", "工业互联网技术", "工业互联网应用",
		"工业机器人技术", "工业设计", "光伏工程技术", "机场电工技术", "机电设备技术", "机电一体化技术", "机械设计与制造", "机械制造及自动化", "机械装备制造技术", "矿山机电与智能装备",
		"轮机工程技术", "模具设计与制造", "设施农业与装备", "数控技术", "数字化设计与制造技术", "铁道车辆技术", "铁道机车运用与维护", "通风技术与安全管理", "通用航空航务技术", "通用航空器维修",
		"无人机应用技术", "现代农业装备应用技术", "印刷媒体技术", "印刷设备应用技术", "智能工程机械运用技术", "智能光电制造技术", "智能机电技术", "智能机器人技术", "智能控制技术",
		"智能制造装备技术"
	],
	["宠物养护与驯导", "宠物医疗技术", "动物防疫与检疫", "动物药学", "动物医学", "动物营养与饲料", "兽药制药技术", "水产养殖技术", "特种动物养殖技术", "畜牧兽医", "畜禽智能化养殖"],
	["表演艺术", "钢琴调律", "歌舞表演", "国际标准舞", "乐器制造与维护", "曲艺表演", "时尚表演与传播", "舞蹈编导", "舞蹈表演", "舞蹈教育", "戏剧影视表演", "戏曲表演", "戏曲音乐",
		"现代流行音乐", "现代魔术设计与表演", "音乐表演", "音乐教育", "音乐剧表演"
	],
	["测绘地理信息技术", "测绘工程技术", "地籍测绘与土地管理", "房地产智能检测与估价", "高速铁路施工与维护", "给排水工程技术", "工程测量技术", "工程造价", "国土空间规划与测绘",
		"国土资源调查与管理", "环境工程技术", "建设工程管理", "建设工程监理", "建筑钢结构工程技术", "建筑工程技术", "空间数字建模与应用技术", "摄影测量与遥感技术", "水利工程",
		"水利水电工程技术", "水利水电建筑工程", "水生态修复技术", "水土保持技术", "水文与工程地质", "水文与水资源技术", "无人机测绘技术", "制冷与空调技术", "治河与航道工程技术",
		"装配式建筑工程技术"
	],
	["城市轨道车辆应用技术", "城市轨道交通车辆制造与维护", "城市轨道交通机电技术", "电机与电器技术", "电力系统自动化技术", "电气自动化技术", "电梯工程技术", "电线电缆制造技术", "动车组检修技术",
		"纺织机电技术", "飞机部件修理", "飞机电子设备维修", "飞机机电设备维修", "飞机结构修理", "工业产品质量检测技术", "工业工程技术", "工业过程自动化技术", "工业互联网技术", "工业互联网应用",
		"工业机器人技术", "工业设计", "光伏工程技术", "机场电工技术", "机电设备技术", "机电一体化技术", "机械设计与制造", "机械制造及自动化", "机械装备制造技术", "矿山机电与智能装备",
		"轮机工程技术", "模具设计与制造", "设施农业与装备", "数控技术", "数字化设计与制造技术", "铁道车辆技术", "铁道机车运用与维护", "通风技术与安全管理", "通用航空航务技术", "通用航空器维修",
		"无人机应用技术", "现代农业装备应用技术", "印刷媒体技术", "印刷设备应用技术", "智能工程机械运用技术", "智能光电制造技术", "智能机电技术", "智能机器人技术", "智能控制技术",
		"智能制造装备技术"
	],
	["城市轨道车辆应用技术", "城市轨道交通车辆制造与维护", "城市轨道交通机电技术", "电机与电器技术", "电力系统自动化技术", "电气自动化技术", "电梯工程技术", "电线电缆制造技术", "动车组检修技术",
		"纺织机电技术", "飞机部件修理", "飞机电子设备维修", "飞机机电设备维修", "飞机结构修理", "工业产品质量检测技术", "工业工程技术", "工业过程自动化技术", "工业互联网技术", "工业互联网应用",
		"工业机器人技术", "工业设计", "光伏工程技术", "机场电工技术", "机电设备技术", "机电一体化技术", "机械设计与制造", "机械制造及自动化", "机械装备制造技术", "矿山机电与智能装备",
		"轮机工程技术", "模具设计与制造", "设施农业与装备", "数控技术", "数字化设计与制造技术", "铁道车辆技术", "铁道机车运用与维护", "通风技术与安全管理", "通用航空航务技术", "通用航空器维修",
		"无人机应用技术", "现代农业装备应用技术", "印刷媒体技术", "印刷设备应用技术", "智能工程机械运用技术", "智能光电制造技术", "智能机电技术", "智能机器人技术", "智能控制技术",
		"智能制造装备技术"
	],
	["大数据技术", "动漫制作技术", "计算机网络技术", "计算机应用技术", "健康大数据管理与服务", "跨境电子商务", "林业信息技术应用", "农村电子商务", "区块链技术应用", "人工智能技术应用",
		"融媒体技术与运营", "软件技术", "商务数据分析与应用", "数字媒体技术", "司法信息技术", "卫生信息管理", "物联网应用技术", "信息安全技术应用", "虚拟现实技术应用", "移动互联应用技术",
		"移动商务", "移动应用开发", "智慧城市管理技术", "智慧旅游技术应用"
	],
	["包装策划与设计", "包装工程技术", "宝玉石鉴定与加工", "产品艺术设计", "动漫设计", "动漫制作技术", "纺织品设计", "服装陈列与展示设计", "服装设计与工艺", "服装与服饰设计", "工业设计",
		"工艺美术品设计", "公共艺术设计", "广告艺术设计", "环境艺术设计", "家具艺术设计", "建筑动画技术", "建筑设计", "建筑室内设计", "建筑装饰工程技术", "美术教育", "民族传统技艺",
		"民族服装与饰品", "民族美术", "皮具制作与工艺", "人物形象设计", "融媒体技术与运营", "摄影摄像技术", "摄影与摄像艺术", "时尚表演与传播", "视觉传达设计", "室内艺术设计",
		"首饰设计与工艺", "书画艺术", "数字媒体技术", "数字媒体艺术设计", "陶瓷设计与工艺", "舞台艺术设计与制作", "艺术设计", "影视动画", "影视多媒体技术", "游戏艺术设计", "玉器设计与工艺",
		"展示艺术设计"
	],
	["安全技术与管理", "地籍测绘与土地管理", "电厂化学与环保技术", "分析检验技术", "给排水工程技术", "化工生物技术", "化工装备技术", "环境工程技术", "环境管理与评价", "环境监测技术",
		"绿色低碳技术", "煤化工技术", "生态保护技术", "生态环境修复技术", "水净化与安全技术", "水文与工程地质", "通风技术与安全管理", "消防救援技术", "应急救援技术", "应用化工技术",
		"职业健康安全技术", "智能环保装备技术"
	],
	["汽车电子技术", "汽车技术服务与营销", "汽车检测与维修技术", "汽车造型与改装技术", "汽车制造与试验技术", "汽车智能技术", "新能源汽车技术", "新能源汽车检测与维修技术", "智能网联汽车技术"],
	["测绘地理信息技术", "测绘工程技术", "城市轨道交通工程技术", "城市轨道交通运营管理", "道路工程检测技术", "道路工程造价", "道路与桥梁工程技术", "地籍测绘与土地管理", "房地产经营与管理",
		"房地产智能检测与估价", "港口与航道工程技术", "港口与航运管理", "工程测量技术", "工程造价", "国土空间规划与测绘", "国土资源调查与管理", "建设工程管理", "建设工程监理", "建筑工程技术",
		"建筑经济信息化管理", "建筑设备工程技术", "建筑设计", "建筑室内设计", "建筑装饰工程技术", "空间数字建模与应用技术", "摄影测量与遥感技术", "水利工程", "水利水电建筑工程",
		"水政水资源管理", "无人机测绘技术", "现代物业管理", "治河与航道工程技术", "智能建造技术", "装配式建筑工程技术"
	]
]
	
	// 合并与去重
	const mergedArray = allArrays.flat();
	const uniqueArray = [...new Set(mergedArray)];
	let a = JSON.stringify(uniqueArray)
	console.log(a); // 输出无重复项的最终数组
}
